[

    {
      "name": "AutoSearch",
      "description": "I wanted to search the entire internet of cars for sale without having to navigate through promoted vehicles and websites. I used Python and Django’s web templates to interact with my SQLite database. I also wanted to use an external API to gather the data from and store it in my own db for reference. I’ve built this app that uses MarketCheck’s Api. Their bots crawl all of the used car listings and place them in an API. ",
      "image": "./images/profile-image.JPG",
      "gif": "./gifs/autosearch.gif",
      "url": "https://github.com/MrNoIce/Auto-Search-App",
      "tech": [" Python, ", "Django ", "Templates, ", "REST API, ", "Bootstrap"]
    },
    {
      "name": "OurCity",
      "description": "A single page, responsive, web app built for raising critical infrastructure defects to the officials that have the power to resolve them. I developed the app using react.js, styling with bootstrap, and a simple JSON server for the backend. I used two API’s, one is the Cloudinary API for image upload and storage and the second is the MapBox API for acquiring coordinates for the issue form and the interactive map. ",
      "image": "./images/profile-image.JPG",
      "gif": "./gifs/autosearch.gif",
      "url": "https://github.com/MrNoIce/Front-End-Capstone",
      "tech": [" React, ", "MapBox, ", "JSON, ", "Bootstrap"]
    },
    {
      "name": "Profile",
      "description": "This site is built with Gatsby. A React-based, GraphQL powered, static site generator. It uses powerful preconfiguration to build a website that uses only static files for incredibly fast page loads, service workers, code splitting, server-side rendering, intelligent image loading, asset optimization, and data prefetching. I chose Gatsby so I could learn something new and get some experience with GraphQl.",
      "image": "./images/profile-image.JPG",
      "gif": "./gifs/autosearch.gif",
      "url": "https://github.com/MrNoIce/projectsite",
      "tech": [" Gatsby, ", "React, ", "GraphQl " ]
    },
    {
      "name": "1972 Mercedes 250",
      "description": "I wanted a fun, cruiser sedan with a little power. I always had an eye for the W114 Mercedes chassis and when one came up for sale, I scooped it up once the owner dropped the price. The owner before him put in a carbureted chevy small block 305 which was terribly under powered, so naturally, that had to go. I decided to go with the classic aluminum LS6 series chevy engine due to its cheap and easy power output. The build was pretty straightforward - simple boltons, a cam, fresh heads, and a tune would bring the power of the car right to 420 horsepower. I had few initial hiccups due to some fitment issues with the swap; the steering linkage and gear box location. I was able to modify the steering link to get the clearance I needed, notched the frame and inch on both sides to fit the headers, along with rerouting the exhaust to fit around the gear box. The fuel pump was originally a mechanical fuel pump operated by the engine however, I needed to supply the new engine with a constant feed of fuel from the old tank. This was executed through a returnless system with an external fuel pump operated by the computer. Overall I had a blast with the build and am looking forward to my next project. ",
      "image": "./images/profile-image.JPG",
      "gif": "./gifs/autosearch.gif",
      "url": "https://youtu.be/19YgtSZUFa0",
      "tech": ["Engine building, tuning, and swapping : ", "Welding and Fabrication : ", " Wiring"]
    }
]
